In [1]:
#<font color='red'> Pandas </font>

 <font color='red'> Pandas </font>
<font color='blue'>It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python </font>. <font color='red'> pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib.</font>
<font color='blue'>pandas adopts significant
parts of NumPy’s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops. pandas is designed for working with tabular or heterogeneous data.</font>


<font color='green'>Series:
A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.
The simplest Series is formed from only an array of data:
e.g; obj = pd.Series([4, 7, -5, 3])</font>

<font color='red'> you can create a Series from it by
passing the dict:
  sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
  obj3 = pd.Series(sdata)
  *in output section keys are index and values are value. ***There are many ways to construct a DataFrame, though one of the most common is
from a dict of equal-length lists or NumPy arrays:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)</font>

# <font color='blue'>Pandas Data Frame</font>

In [1]:

import pandas as pd

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

#print(apples, oranges)
data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [2]:
import pandas as pd

apples = pd.Series([3,2,0,1], ["a", "b", "c", "d"] )
oranges = pd.Series([3,2,0,1], index = ["mon", "tue", "wed", "thr"])

#print(apples, oranges)
data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

     apples  oranges
a       3.0      NaN
b       2.0      NaN
c       0.0      NaN
d       1.0      NaN
mon     NaN      3.0
thr     NaN      1.0
tue     NaN      2.0
wed     NaN      0.0

In [3]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}# dict take state as a input 
state_pop_df = pd.DataFrame(data 
                     , index = ['1st', '2nd', '3rd', 
                                '4th', '5th','6th'] ) # the vab data converted into data frame
print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [4]:
state_pop_df =pd.DataFrame(data, columns=['year', 'state', 'pop'])# updating columns
print(state_pop_df)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [5]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six']) # we can add new columns and can update the index
frame2.head()

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [6]:
print(frame2.columns)
print( frame2.index )

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [7]:

print(data)
data['state']
# this is dictinary like notation to access or extract
# dataframe column data
frame2["state"]

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [8]:
print(frame2.loc['two'] )
frame2.head()

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [9]:
#Columns can be modified by assignment. For example, 
#the empty 'debt' column could be assigned a scalar value or an array of values:
frame2['debt']=122
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   122
two    2001    Ohio  1.7   122
three  2002    Ohio  3.6   122
four   2001  Nevada  2.4   122
five   2002  Nevada  2.9   122
six    2003  Nevada  3.2   122

In [10]:
# important cell for codes review
import numpy as np
import pandas as pd
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'state': state ,
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
        index=['one', 'two', 'three', 'four','five', 'six'])
ln=len(frame2)
rng=np.arange(ln)
frame2['debt']=rng
frame2  #point to remember , inserting new values, needs to be match in length of dataFrame (number of elements)

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [11]:
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2],
            index=['one', 'two', 'three', 'four', 'five',
                   'six', 'seven'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4  -1.2
five   2002  Nevada  2.9  -1.5
six    2003  Nevada  3.2  -1.7

In [12]:
val = pd.Series([-1.2, -1.5, -1.7, 2.6], index=['two', 'four', 'five', 'six'])
frame2['debt'] = val
frame2 #remmeber index length must be equal to values ( or , do not provide index)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   2.6

In [13]:
#Assigning a column that already exist will ________ and 
# assigning a column that does not exist will ________

In [14]:
#reindexing and use of ffill value of parameter method
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print(obj3)
obj3=obj3.reindex(range(8),method='ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
dtype: object

In [15]:
states=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio', 'Texas', 'California'])
print(states)
states=states.reindex(['a','b','c','d'],method='ffill')
states

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [16]:
# column name changing using reindex method
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
print(states)
states_name = ['Texas', 'Utah', 'California','Ohio']
states=states.reindex(columns=states_name)
states

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

   Texas  Utah  California  Ohio
a      1   NaN           2     0
c      4   NaN           5     3
d      7   NaN           8     6

#### Deleting data (row or column from dataframe)

In [17]:
import numpy as np
import pandas as pd
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])
display(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
del data_df['two']

In [19]:
print(data_df)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [20]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")


#You can drop values from the columns by passing axis=1 
#or axis='columns' :
data_df = data_df.drop('two', axis=1)
#data_df.drop('two', axis=1, inplace = True)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [21]:
data_df=data_df.drop('Colorado' ,axis=0)#droping rows

In [22]:
data_df

          one  three  four
Ohio        0      2     3
Utah        8     10    11
New York   12     14    15

##### <font color ='green'>Indexing, Selection, and Filtering</font>

In [23]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
df2 = data_df[ ["one", "three"] ]
display(df2)
#print( data_df[2:] ) # same like numpy select two rows
#print(data_df["one"] )# dicitonary like style of accessing data
#print(data_df.one[2:])  # filter on both row and column starts from row 2 onwards
# Conditonal Selection
#print ( data_df.three[data_df['three'] > 5] )# only print values >5 of column three
#print(data_df, "\n")

#f2 = data_df["three"] > 5  # boolean dataframe
#f2
#print(df2)
print( data_df[  data_df["three"] > 5  ] )

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### <font color='red'>Selection with loc and iloc</font>

In [24]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
# in the loc method specify row label first 
# then specify column names
# remember! mutiple column names require array notation
print( data_df.loc[['Colorado','Ohio'], ['two',  'three'] ] )
print("\n")
#print( data_df.iloc[2:, [3, 0, 1] ] ) # using number instead of labels
#print( data_df.iloc[:])
#print ( data_df.iloc[ :3 , :3 ] )
print( data_df.iloc[:, :3])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          two  three
Colorado    5      6
Ohio        1      2


          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

##### <font color='red'>Arithmetic and Data Alignment</font>

In [25]:
#print(list('bcd'))
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1)
print(df2)
print()
# applying plus operation between two data frames
df3 = df1 + df2

print(df3)
# your work is to fill all Nan values of  this df3 with a number, 
# choice of number is yours

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

##### Arithmetic methods with fill values

In [26]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)),
                    columns=list('abcde'))
#print(df1)
#print(df2)

df2.loc[2,[ 'b','d','e']] = np.nan
print(df2)
df3 = df1 + df2
print()
print("direct + operation without fill_value")
print(df3)
print("--------")
print()
# We can use add method for filling NaN cells with a value
# Nan will be replaced by 0 and then addition operation will apply
print("addition using a method with replacing Nan with 0")
df3 =df1.radd(df2,fill_value=0)
print(df3)

    a     b   c     d     e
0   0   1.0   2   3.0   4.0
1   5   6.0   7   8.0   9.0
2  10   NaN  12   NaN   NaN
3  15  16.0  17  18.0  19.0

direct + operation without fill_value
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0   NaN  22.0   NaN NaN
3   NaN   NaN   NaN   NaN NaN
--------

addition using a method with replacing Nan with 0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0   9.0  22.0  11.0   NaN
3  15.0  16.0  17.0  18.0  19.0

#### Hierarchical Indexing in Series

In [27]:
data=pd.Series(np.random.randn(10),
              index=([['a','a','a','a','b','b','b','d','e','f'],
                    [1,1,1,1,2,2,2,3,4,5]]))# Double indexing 
data

a  1   -0.313608
   1    1.419298
   1    1.731636
   1    0.841080
b  2   -1.288068
   2    0.397315
   2   -0.650882
d  3    0.223501
e  4    1.653560
f  5   -0.781266
dtype: float64

In [28]:
print(data.loc[:,2])
print(data.loc[['b']])
display(data[['b','e']])

b   -1.288068
b    0.397315
b   -0.650882
dtype: float64
b  2   -1.288068
   2    0.397315
   2   -0.650882
dtype: float64

b  2   -1.288068
   2    0.397315
   2   -0.650882
e  4    1.653560
dtype: float64

Hierarchical indexing plays an important role in reshaping data and group-based
operations like forming a pivot table. For example, you could rearrange the data into
a DataFrame using its unstack method

In [29]:
data=pd.Series(np.random.randn(10),
              index=([['a','a','a','a','b','b','b','d','e','f'],
                    [1,2,3,4,3,2,1,3,4,5]]))
df=data.unstack()# change data into data frame 
print(df)
df.stack()#

          1         2         3         4         5
a  1.552899  0.970687  0.054211 -0.356231       NaN
b -0.538911  0.272410 -0.359080       NaN       NaN
d       NaN       NaN -0.365635       NaN       NaN
e       NaN       NaN       NaN  1.312075       NaN
f       NaN       NaN       NaN       NaN -0.198164

a  1    1.552899
   2    0.970687
   3    0.054211
   4   -0.356231
b  1   -0.538911
   2    0.272410
   3   -0.359080
d  3   -0.365635
e  4    1.312075
f  5   -0.198164
dtype: float64

#### Hierarchical indexing in Data Frame

In [30]:
#With a DataFrame, either axis can have a hierarchical index:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame.index.names=['key1','key2']
frame.columns.names=['states','color']
frame

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [32]:
frame.swaplevel('key1','key2')

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [33]:
frame.sort_index(level=1)

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [34]:
frame.sort_index()

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [35]:
frame.swaplevel(0,1).sort_index(level=0)

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### Summary Statistic by level

In [36]:
#for addition of rows
print(frame.sum(level='key1')) # it adds a=0 and a=3, b=6 and b=9

states  Ohio     Colorado
color  Green Red    Green
key1
a          3   5        7
b         15  17       19

In [37]:
print(frame.sum(level='key2'))

states  Ohio     Colorado
color  Green Red    Green
key2
1          6   8       10
2         12  14       16

In [38]:
display(frame)
frame.sum(level='color',axis=1)

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [39]:
dtf=pd.DataFrame({'a':range(7),
                'b':range(7,0,-1),
                'c':['one','one','one','two','two','two','three'],
                'd':[1,1,1,2,2,2,3]})
dtf

   a  b      c  d
0  0  7    one  1
1  1  6    one  1
2  2  5    one  1
3  3  4    two  2
4  4  3    two  2
5  5  2    two  2
6  6  1  three  3

In [40]:
dt=dtf.set_index(['c', 'd'])
dt

         a  b
c     d
one   1  0  7
      1  1  6
      1  2  5
two   2  3  4
      2  4  3
      2  5  2
three 3  6  1

In [41]:
#By default the columns are removed from the DataFrame, though you can leave them in
dtf.set_index(['c','d'],drop=False)

         a  b      c  d
c     d
one   1  0  7    one  1
      1  1  6    one  1
      1  2  5    one  1
two   2  3  4    two  2
      2  4  3    two  2
      2  5  2    two  2
three 3  6  1  three  3

In [42]:
#reset_index , on the other hand, does the opposite of set_index ; the hierarchical index levels are moved into the columns
dtf.reset_index()

   index  a  b      c  d
0      0  0  7    one  1
1      1  1  6    one  1
2      2  2  5    one  1
3      3  3  4    two  2
4      4  4  3    two  2
5      5  5  2    two  2
6      6  6  1  three  3

### <font color='Green'>Handling Missing Data </font>

In [43]:
#using pandas.isnull and boolean indexing, the dropna can be helpful.
#On a Series, it returns the Series with only the non-null data and index values
import numpy as np
import pandas as pd
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
display(data.dropna())
#This is equivalent to:
display(data[data.notnull()])

0    1.0
2    3.5
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [44]:
#With DataFrame objects, things are a bit more complex. You may want to drop rows
#or columns that are all NA or only those containing any NAs. dropna by default drops
#any row containing a missing value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
display(data)
cleaned=data.dropna()
display(cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [45]:
#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [46]:
#To drop columns in the same way, pass axis=1 :
data[4]=NA
display(data)
data.dropna(how='all',inplace=False)

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [47]:
#Supposeyou want to keep only rows containing a certain number of observations. You can
#indicate this with the thresh argument:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:3,2]=NA
df.iloc[:2,1]=NA
df
df.dropna()

          0         1         2
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

In [49]:
display(df)
df.dropna(thresh=2)

          0         1         2
0  0.783991       NaN       NaN
1 -0.732601       NaN       NaN
2 -0.591145  0.765797       NaN
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

          0         1         2
2 -0.591145  0.765797       NaN
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

### <font color='green'>Filling In Missing Data</font>

In [50]:
#Rather than filtering out missing data (and potentially discarding other data along
#with it), you may want to fill in the “holes” in any number of ways. For most pur‐
#poses, the fillna method is the workhorse function to use. Calling fillna with a
#constant replaces missing values with that value:
display(df)
df.fillna('--')# or you can use a number

          0         1         2
0  0.783991       NaN       NaN
1 -0.732601       NaN       NaN
2 -0.591145  0.765797       NaN
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

          0          1         2
0  0.783991         --        --
1 -0.732601         --        --
2 -0.591145   0.765797        --
3 -1.313182    1.24336   1.56979
4 -0.108403    1.17128 -0.222292
5  0.327238   0.635072  0.907907
6  0.545633 -0.0170019  0.183196

In [51]:
#Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({1:0.0,2:0.1})

          0         1         2
0  0.783991  0.000000  0.100000
1 -0.732601  0.000000  0.100000
2 -0.591145  0.765797  0.100000
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

In [52]:
#fillna returns a new object, but you can modify the existing object in-place:
df.fillna(0,inplace=True)
df

          0         1         2
0  0.783991  0.000000  0.000000
1 -0.732601  0.000000  0.000000
2 -0.591145  0.765797  0.000000
3 -1.313182  1.243364  1.569790
4 -0.108403  1.171281 -0.222292
5  0.327238  0.635072  0.907907
6  0.545633 -0.017002  0.183196

In [53]:
#The same interpolation methods available for reindexing can be used with fillna :
df = pd.DataFrame(np.random.randn(6, 5))
df.iloc[2:5,1]=NA
df.iloc[:2,3:4]=NA
df

          0         1         2         3         4
0 -2.159107  0.195893 -0.181439       NaN  0.078752
1  1.662407 -2.768124  1.330550       NaN -0.460343
2 -0.503815       NaN -0.542981 -0.056396 -0.688704
3  0.694160       NaN  0.271155 -1.010397 -1.108426
4  0.677444       NaN  1.779753  0.084028 -0.782833
5 -1.178171 -0.233168  0.283764 -2.799185  0.821763

In [68]:
df.fillna(method='ffill')

0    1.0
1    2.0
2    2.0
3    2.0
4    4.0
5    5.0
6    6.0
dtype: float64

In [69]:
df.fillna(method='ffill',limit=4)

0    1.0
1    2.0
2    2.0
3    2.0
4    4.0
5    5.0
6    6.0
dtype: float64

In [70]:
#With fillna you can do lots of other things with a little creativity. For example, you
#might pass the mean or median value of a Series:
df=pd.Series([1,2,NA,NA,4,5,6])
df
df.fillna(df.mean())

0    1.0
1    2.0
2    3.6
3    3.6
4    4.0
5    5.0
6    6.0
dtype: float64

### <font color='green'>Data Transformation</font>
<font color='blue'>*Removing Duplicates::</font>

In [71]:
#The DataFrame method duplicated returns a boolean Series indicating whether each
#row is a duplicate (has been observed in a previous row) or not
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
display(data)
display(data.duplicated())
display(data.drop_duplicates())

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data['vol']=range(7)
data

    k1  k2  vol
0  one   1    0
1  two   1    1
2  one   2    2
3  two   3    3
4  one   3    4
5  two   4    5
6  two   4    6

In [73]:
#we had an additional column of vol and wanted to filter duplicates only based on the 'k1' column:
data.drop_duplicates(['k1'])

    k1  k2  vol
0  one   1    0
1  two   1    1

In [74]:
#it will keep last
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  vol
0  one   1    0
1  two   1    1
2  one   2    2
3  two   3    3
4  one   3    4
6  two   4    6

### <font color='green'>Transforming Data Using a Function or Mapping</font>

In [75]:
data = pd.DataFrame({'food': ['roosh', 'chick karahi', 'bacon',
                              'mutton', 'sajji', 'karahi',
                              'nehari', 'koftay', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

           food  ounces
0         roosh     4.0
1  chick karahi     3.0
2         bacon    12.0
3        mutton     6.0
4         sajji     7.5
5        karahi     8.0
6        nehari     3.0
7        koftay     5.0
8      nova lox     6.0

In [76]:
meat_to_animal = {'roosh': 'lamb','chick_karahi ':'biryanii','nehari': 'camel','pastrami': 'cow',
                  'corned_beef': 'cow','mutton': 'bakra',
                  'nova_lox': 'salmon'}
meat_to_animal

{'roosh': 'lamb',
 'chick_karahi ': 'biryanii',
 'nehari': 'camel',
 'pastrami': 'cow',
 'corned_beef': 'cow',
 'mutton': 'bakra',
 'nova_lox': 'salmon'}

In [77]:
#we need to lover case all data
lowercased=data['food'].str.lower()
lowercased

0           roosh
1    chick karahi
2           bacon
3          mutton
4           sajji
5          karahi
6          nehari
7          koftay
8        nova lox
Name: food, dtype: object

In [78]:
data['animal']=lowercased.map(meat_to_animal)
data

           food  ounces animal
0         roosh     4.0   lamb
1  chick karahi     3.0    NaN
2         bacon    12.0    NaN
3        mutton     6.0  bakra
4         sajji     7.5    NaN
5        karahi     8.0    NaN
6        nehari     3.0  camel
7        koftay     5.0    NaN
8      nova lox     6.0    NaN

In [77]:
data.fillna('---')

           food  ounces animal
0         roosh     4.0   lamb
1  chick karahi     3.0    ---
2         bacon    12.0    ---
3        mutton     6.0  bakra
4         sajji     7.5    ---
5        karahi     8.0    ---
6        nehari     3.0  camel
7        koftay     5.0    ---
8      nova lox     6.0    ---

In [78]:
#we can pass a functio for lower case
#data['food'].map(lambda x:meat_to_animal[x.lower()])

### <font color='green'>Replacing Values</font>

In [79]:
import numpy as np
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [80]:
#The -999 values might be sentinel values for missing data. To replace these with NA
#values that pandas understands, we can use replace , producing a new Series (unlessyou pass inplace=True ):
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [81]:
#If you want to replace multiple values at once, you instead pass a list and then the substitute value
display(data)
display(data.replace([-999,-1000],np.nan))

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### <font color='green'>Renaming Axis Indexes</font>

In [82]:
#you can transform axis
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
display(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [83]:
transform=lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [84]:
#You can assign to index , modifying the DataFrame in-place:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [88]:
#If you want to create a transformed version of a dataset without 
#modifying the origi‐nal, a useful method is rename :
data.rename(index=str.upper,columns=str.title)# ypu can pass title

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [89]:
#Notably, rename can be used in conjunction with a dict-like object providing new val‐
#ues for a subset of the axis labels:
new_data=data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})
display(new_data)
new_data.rename(index=str.lower,columns=str.upper)

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

         ONE  TWO  PEEKABOO  FOUR
indiana    0    1         2     3
colo       4    5         6     7
new        8    9        10    11

In [93]:
data.rename(index={'colo':'molo'},inplace=True)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### <font color='green'>Discretization and Binning</font>
<font color='red'>Continuous data is often discretized or otherwise separated into “bins” for analysis.
Suppose you have data about a group of people in a study, and you want to group
them into discrete age buckets:
Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use cut , a function in pandas:</font>

In [76]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18,25,35,60,100]
ct=pd.cut(ages,bins)
ct

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [77]:
#internally it contains a categories array specifying the dis‐
#tinct category names along with a labeling for the ages data in the codes attribute:
ct.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [78]:
ct.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [79]:
pd.value_counts(ct)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [80]:
#Consistent with mathematical notation for intervals, a parenthesis means that the side
#is open, while the square bracket means it is closed (inclusive). You can change which
#side is closed by passing right=False :
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [81]:
#You can also pass your own bin names by passing a list or array to the labels option:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

 <font color='red'>If you pass an integer number of bins to cut instead of explicit bin edges, it will com‐
pute equal-length bins based on the minimum and maximum values in the data.
Consider the case of some uniformly distributed data chopped into fourths:</font>

In [107]:
data=np.random.randn(20)
pd.cut(data,4,precision=2)
#The precision=2 option limits the decimal precision to two digits.

[(-0.16, 0.42], (-0.75, -0.16], (-0.75, -0.16], (-0.75, -0.16], (-0.75, -0.16], ..., (-0.16, 0.42], (1.01, 1.59], (-0.16, 0.42], (-0.16, 0.42], (-0.75, -0.16]]
Length: 20
Categories (4, interval[float64]): [(-0.75, -0.16] < (-0.16, 0.42] < (0.42, 1.01] < (1.01, 1.59]]

In [110]:
#CUT
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18,25,35,60,100]
ct=pd.cut(ages,bins)
print(ct)
display(ct.value_counts())

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

### <font color='red'>Detecting and Filtering Outliers</font>
<font color='green'>Filtering or transforming outliers is largely a matter of applying array operations.
Consider a DataFrame with some normally distributed data</font>

In [111]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.054007    -0.013322     0.010729     0.039621
std       0.990357     0.973167     1.011930     1.030052
min      -2.756977    -3.576389    -2.868549    -2.996308
25%      -0.729546    -0.666896    -0.667314    -0.703939
50%      -0.041109     0.003092     0.033262    -0.014941
75%       0.590830     0.644414     0.690696     0.788216
max       3.155933     2.693939     3.289497     3.005674

In [118]:
#Suppose you wanted to find values in one of the columns exceeding 3 in absolute value:
col=data[3]
col[np.abs(col)>3]

Series([], Name: 3, dtype: float64)

In [121]:
#To select all rows having a value exceeding 3 or –3, you can use the any method on a boolean DataFrame:
data[(np.abs(data)>3).any(1)]

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [120]:
#Values can be set based on these criteria. Here is code to cap values outside the inter‐val –3 to 3:
data[(np.abs(data)>3)]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.054163    -0.012155     0.010089     0.033611
std       0.989863     0.969292     1.009951     1.021455
min      -2.756977    -3.000000    -2.868549    -2.996308
25%      -0.729546    -0.666896    -0.667314    -0.703939
50%      -0.041109     0.003092     0.033262    -0.014941
75%       0.590830     0.644414     0.690696     0.780850
max       3.000000     2.693939     3.000000     2.979736

In [122]:
data[(np.abs(data)>3)]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [123]:
#The statement np.sign(data) produces 1 and –1 values based on 
#whether the values in data are positive or negative:
np.sign(data).head(6)

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0  1.0
5 -1.0 -1.0  1.0  1.0

### <font color='red'>Permutation and Random Sampling</font>
<font color='green'>Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function. Calling permutation with the length
of the axis you want to permute produces an array of integers indicating the new ordering:</font>

In [126]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [128]:
#to select a random subset without replacement, you can use the sample method on Series and DataFrame:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [131]:
#to generate a sample with replacement (to allow repeat choices), pass replace=True to sample :
choices = pd.Series([5, 7, -1, 6, 4])
draw=choices.sample(n=6,replace=True)
draw

0    5
2   -1
4    4
1    7
4    4
0    5
dtype: int64

### <font color='red'>Dummy Variables//One hot encoding</font>

In [132]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

### <font color='red'>Combining and Merging Datasets</font>

In [133]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
df=pd.merge(df1,df2)
df

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [134]:
df_on_key=pd.merge(df1,df2,on ='key')
df_on_key

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [135]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df_join=pd.merge(df3,df4,left_on='lkey',right_on='rkey')
df_join

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

<font color='red'>You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables. Other possible options are 'left' ,
'right' , and 'outer' . The outer join takes the union of the keys, combining the
effect of applying both left and right joins</font>

Different Types of SQL JOINs
(outer) JOIN: Returns records all values in both tables.

(INNER) JOIN: Returns records that have matching values in both tables.

LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table.

RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table.

In [136]:
df_outer=pd.merge(df1,df2,how='outer')
df_outer

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [137]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
mrg_df=pd.merge(left,right,on=['key1','key2'],how='outer')
mrg_df

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [139]:
lft_dt=pd.DataFrame({'val':np.arange(5),
                     'key':['a','a','b','c','c']})#left join
rght_dt=pd.DataFrame({'val1':np.arange(3)},index=['a','d','b'])
mrg_data=pd.merge(lft_dt,rght_dt,left_on='key',right_index=True)
mrg_data

   val key  val1
0    0   a     0
1    1   a     0
2    2   b     2

In [140]:
right_join=pd.merge(rght_dt,lft_dt,right_on='key',left_index=True)
right_join

   val1  val key
0     0    0   a
1     0    1   a
2     2    2   b

### <font color='green'>Concatenating Along an Axis</font>
<font color='red'>Calling concat with these objects in a list glues together the values and indexesplacing data . side by side or placing data after another</font>

In [141]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2=pd.Series(([2,3]),index=['c','d'])
s3=pd.Series(([4,5]),index=['e','f'])
cont=pd.concat([s1,s2,s3])
cont

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [142]:
#By default concat works along axis=0 , producing another Series. If you pass axis=1 ,
#the result will instead be a DataFrame ( axis=1 is the columns):
pd.concat([s1,s2,s3],axis=1)

/home/zulkifel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  NaN  4.0
f  NaN  NaN  5.0

In [143]:
adata=pd.concat([s1,s3],axis=1,join='inner')
adata

Empty DataFrame
Columns: [0, 1]
Index: []

In [146]:
pd.concat([s1, s3], axis=1, join_axes=[['a', 'c', 'b', 'e']])

/home/zulkifel/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

     0    1
a  0.0  NaN
c  NaN  NaN
b  1.0  NaN
e  NaN  4.0

In [147]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['three', 'four'])
pd.concat([df1,df2],axis=1,keys=['level1','level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [148]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [149]:
#passing dic instead of keys
pd.concat({'level1': df1, 'level2': df2}, axis=1,sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [150]:
pd.concat([df1,df2],keys=['level1','level2'],names=['upper','lower'],axis=1,sort=True)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [151]:
pd.concat([df1, df2], ignore_index=True,sort=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN

In [152]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data_p=pd.concat([s1,s2],keys=['one','two'])
data_p

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [153]:
data_p.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [154]:
data_p.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [156]:
data_p.unstack().stack(dropna=True)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

### <font color='green'>Pivoting "Long" to "Wide" Format.</font>
<font color = blue>pandas.melt . Rather than trans‐
forming one column into many in a new DataFrame, it merges multiple columns into
one, producing a DataFrame that is longer than the input.
Using pivot , we can reshape back to the original layout:</font>

In [157]:
df= pd. DataFrame({'key':['do','go','flow','row','bow'],
                   'A':[1,2,3,4,5],
                   'B':[6,7,8,9,10],
                   'C':[3,2,1,4,5]})
melted=pd.melt(df,['key'])
melted

     key variable  value
0     do        A      1
1     go        A      2
2   flow        A      3
3    row        A      4
4    bow        A      5
5     do        B      6
6     go        B      7
7   flow        B      8
8    row        B      9
9    bow        B     10
10    do        C      3
11    go        C      2
12  flow        C      1
13   row        C      4
14   bow        C      5

In [159]:
reshape=melted.pivot('key','variable','value')
reshape

variable  A   B  C
key
bow       5  10  5
do        1   6  3
flow      3   8  1
go        2   7  2
row       4   9  4

In [161]:
#Since the result of pivot creates an index from the column used as the row labels, we
#may want to use reset_index to move the data back into a column
reshape.reset_index()

variable   key  A   B  C
0          bow  5  10  5
1           do  1   6  3
2         flow  3   8  1
3           go  2   7  2
4          row  4   9  4

In [162]:
#you can specify a subset of columns to use as values columns
pd.melt(df, id_vars=['key'],value_vars=['A','B'])

    key variable  value
0    do        A      1
1    go        A      2
2  flow        A      3
3   row        A      4
4   bow        A      5
5    do        B      6
6    go        B      7
7  flow        B      8
8   row        B      9
9   bow        B     10

In [163]:
pd.melt(df,value_vars=['key','A','B'])

   variable value
0       key    do
1       key    go
2       key  flow
3       key   row
4       key   bow
5         A     1
6         A     2
7         A     3
8         A     4
9         A     5
10        B     6
11        B     7
12        B     8
13        B     9
14        B    10

In [164]:
titanic=pd.read_csv('titanic/test.csv')
titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [168]:
mltd=pd.melt(titanic,id_vars=['Name'],value_vars=['Age'])
mltd

                                             Name variable  value
0                                Kelly, Mr. James      Age   34.5
1                Wilkes, Mrs. James (Ellen Needs)      Age   47.0
2                       Myles, Mr. Thomas Francis      Age   62.0
3                                Wirz, Mr. Albert      Age   27.0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)      Age   22.0
..                                            ...      ...    ...
413                            Spector, Mr. Woolf      Age    NaN
414                  Oliva y Ocana, Dona. Fermina      Age   39.0
415                  Saether, Mr. Simon Sivertsen      Age   38.5
416                           Ware, Mr. Frederick      Age    NaN
417                      Peter, Master. Michael J      Age    NaN

[418 rows x 3 columns]

In [169]:
reshaped=mltd.pivot('Name','variable','value')
reshaped.head()

variable                                    Age
Name
Abbott, Master. Eugene Joseph              13.0
Abelseth, Miss. Karen Marie                16.0
Abelseth, Mr. Olaus Jorgensen              25.0
Abrahamsson, Mr. Abraham August Johannes   20.0
Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0

In [170]:
reshaped.reset_index()

variable                                           Name   Age
0                         Abbott, Master. Eugene Joseph  13.0
1                           Abelseth, Miss. Karen Marie  16.0
2                         Abelseth, Mr. Olaus Jorgensen  25.0
3              Abrahamsson, Mr. Abraham August Johannes  20.0
4             Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0
..                                                  ...   ...
413                          de Brito, Mr. Jose Joaquim  32.0
414                de Messemaeker, Mr. Guillaume Joseph  36.5
415       del Carlo, Mrs. Sebastiano (Argenia Genovesi)  24.0
416                 van Billiard, Master. James William   NaN
417                   van Billiard, Master. Walter John  11.5

[418 rows x 2 columns]